; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v9 ?v10)
             (pred_12 ?v8 ?v7)
             (pred_5 ?v9 ?v7)
             (pred_6 ?v6 ?v9 )
	     (pred_2 ?v9)
             (pred_7 ?v5)
             (pred_1 ?v8)
             (pred_8 ?v7)
             (pred_9 ?v9)
             (pred_4 ?v8)
             (pred_11 ?v9)
             (pred_10 ))



(:action op_5
:parameters (?v13 ?v12 ?v4 ?v3)
:precondition (and (pred_7 ?v13) (pred_7 ?v12) (pred_1 ?v4) (pred_8 ?v3)
          (pred_3 ?v13 ?v12) (pred_12 ?v4 ?v3)
                   (pred_5 ?v12 ?v3) (pred_2 ?v13) 
                   (pred_9 ?v12) (pred_4 ?v4))
:effect (and  (pred_11 ?v12) (not (pred_9 ?v12))))


(:action op_3
:parameters (?v13 ?v1)
:precondition (and (pred_7 ?v13) (pred_7 ?v1)
               (pred_2 ?v13) (pred_3 ?v13 ?v1) (pred_11 ?v1))
:effect (and (pred_2 ?v1) (not (pred_2 ?v13))))

(:action op_2
:parameters (?v13 ?v4)
:precondition (and (pred_7 ?v13) (pred_1 ?v4) 
                  (pred_2 ?v13) (pred_6 ?v4 ?v13) (pred_10 ))
:effect (and (pred_4 ?v4)
   (not (pred_6 ?v4 ?v13)) (not (pred_10 ))))


(:action op_1
:parameters (?v13 ?v11 ?v2)
:precondition (and (pred_7 ?v13) (pred_1 ?v11) (pred_1 ?v2)
                  (pred_2 ?v13) (pred_4 ?v2) (pred_6 ?v11 ?v13))
:effect (and (pred_4 ?v11) (pred_6 ?v2 ?v13)
        (not (pred_4 ?v2)) (not (pred_6 ?v11 ?v13))))

(:action op_4
:parameters (?v13 ?v4)
:precondition (and (pred_7 ?v13) (pred_1 ?v4) 
                  (pred_2 ?v13) (pred_4 ?v4))
:effect (and (pred_10 ) (pred_6 ?v4 ?v13) (not (pred_4 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_06 obj_01 obj_09 obj_02 obj_11 obj_07 obj_10 obj_21 obj_16 obj_08 obj_15 obj_03 obj_13 obj_18 obj_14
    obj_20 obj_19
    obj_04 obj_17 obj_12
    )

    (:init
       (pred_10)

       (pred_7 obj_05)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_7 obj_09)
       (pred_7 obj_02)
       (pred_7 obj_11)
       (pred_7 obj_07)
       (pred_7 obj_10)
       (pred_7 obj_21)
       (pred_7 obj_16)
       (pred_7 obj_08)
       (pred_7 obj_15)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_18)
       (pred_7 obj_14)
       (pred_8 obj_20)
       (pred_8 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_17)
       (pred_1 obj_12)

       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_06)
       (pred_3 obj_06 obj_11)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_06 obj_05)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_02 obj_21)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_06)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_07 obj_08)
       (pred_3 obj_07 obj_10)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_07)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_21 obj_02)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_18 obj_14)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_14 obj_18)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_5  obj_14 obj_20)
       (pred_5  obj_05 obj_19)
       (pred_5  obj_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_16)
       (pred_11 obj_08)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_13)
       (pred_11 obj_18)

       (pred_12  obj_04 obj_20)
       (pred_12  obj_17 obj_19)
       (pred_12  obj_12 obj_20)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_12 obj_02)
       (pred_2 obj_09)
    )

    (:goal (and
       (pred_6 obj_04 obj_01)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_12 obj_07)
    ))
(:constraints
  (always (not (pred_2 obj_16)))
)
)

; plan
1. (op_3 obj_09 obj_01)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_01)
   goals met: 0 of 3
2. (op_3 obj_01 obj_07)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_07)
   goals met: 0 of 3
3. (op_3 obj_07 obj_08)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_08)
   goals met: 0 of 3
4. (op_3 obj_08 obj_18)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_18)
   goals met: 0 of 3
5. (op_3 obj_18 obj_13)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_13)
   goals met: 0 of 3
6. (op_3 obj_13 obj_03)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_03)
   goals met: 0 of 3
7. (op_2 obj_03 obj_04)
   deleted: (pred_6 obj_04 obj_03) (pred_10)
   added: (pred_4 obj_04)
   goals met: 0 of 3
8. (op_3 obj_03 obj_13)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_13)
   goals met: 0 of 3
9. (op_3 obj_13 obj_18)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_18)
   goals met: 0 of 3
10. (op_3 obj_18 obj_08)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_08)
   goals met: 0 of 3
11. (op_3 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_07)
   goals met: 0 of 3
12. (op_3 obj_07 obj_01)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_01)
   goals met: 0 of 3
13. (op_4 obj_01 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_10) (pred_6 obj_04 obj_01)
   goals met: 1 of 3
14. (op_3 obj_01 obj_07)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_07)
   goals met: 1 of 3
15. (op_3 obj_07 obj_08)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_08)
   goals met: 1 of 3
16. (op_3 obj_08 obj_18)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_18)
   goals met: 1 of 3
17. (op_3 obj_18 obj_13)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_13)
   goals met: 1 of 3
18. (op_3 obj_13 obj_03)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_03)
   goals met: 1 of 3
19. (op_3 obj_03 obj_21)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_21)
   goals met: 1 of 3
20. (op_3 obj_21 obj_02)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_02)
   goals met: 1 of 3
21. (op_2 obj_02 obj_12)
   deleted: (pred_6 obj_12 obj_02) (pred_10)
   added: (pred_4 obj_12)
   goals met: 1 of 3
22. (op_3 obj_02 obj_21)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_21)
   goals met: 1 of 3
23. (op_3 obj_21 obj_03)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_03)
   goals met: 1 of 3
24. (op_3 obj_03 obj_13)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_13)
   goals met: 1 of 3
25. (op_3 obj_13 obj_18)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_18)
   goals met: 1 of 3
26. (op_3 obj_18 obj_08)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_08)
   goals met: 1 of 3
27. (op_3 obj_08 obj_07)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_07)
   goals met: 1 of 3
28. (op_4 obj_07 obj_12)
   deleted: (pred_4 obj_12)
   added: (pred_10) (pred_6 obj_12 obj_07)
   goals met: 2 of 3
29. (op_3 obj_07 obj_10)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_10)
   goals met: 2 of 3
30. (op_3 obj_10 obj_15)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_15)
   goals met: 2 of 3
31. (op_2 obj_15 obj_17)
   deleted: (pred_6 obj_17 obj_15) (pred_10)
   added: (pred_4 obj_17)
   goals met: 2 of 3
32. (op_3 obj_15 obj_10)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_10)
   goals met: 2 of 3
33. (op_3 obj_10 obj_09)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_09)
   goals met: 2 of 3
34. (op_3 obj_09 obj_01)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_01)
   goals met: 2 of 3
35. (op_3 obj_01 obj_06)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_06)
   goals met: 2 of 3
36. (op_5 obj_06 obj_05 obj_17 obj_19)
   deleted: (pred_9 obj_05)
   added: (pred_11 obj_05)
   goals met: 2 of 3
37. (op_3 obj_06 obj_05)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_05)
   goals met: 2 of 3
38. (op_4 obj_05 obj_17)
   deleted: (pred_4 obj_17)
   added: (pred_10) (pred_6 obj_17 obj_05)
   goals met: 3 of 3
